console.log("Задача №3: Напишіть гру «Вгадай число». При завантаженні сторінки генерується випадкове число від 0 до 10. Користувачу надається три спроби вгадати число. При кожній перевірці видається підказка: більше чи менше. При вгадуванні або завершенні числа спроб видається оповіщення.Кількість спроб виводиться на екран. Результат для цієї задачі виводиться за допомогою команди alert().");

let targetNumber = Math.floor(Math.random() * 11);
let attempts = 3;

while (attempts > 0) {
  let guess = parseInt(prompt("Вгадайте число (від 0 до 10):"));
  console.log("Ви ввели число:", guess);

  if (guess === targetNumber) {
    console.log("Ви вгадали число!");
    alert("Ви вгадали число!");
    break;
  } else if (guess < targetNumber) {
    console.log("Загадане число більше.");
    alert("Загадане число більше.");
  } else {
    console.log("Загадане число менше.");
    alert("Загадане число менше.");
  }

  attempts--;
}

if (attempts === 0) {
  console.log("Ви не вгадали. Спроби закінчилися. Загадане число:", targetNumber);
  alert("Ви не вгадали. Спроби закінчилися. Загадане число: " + targetNumber);
}
